app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = 2  [["description", "A description of a community project."], ["updated_at", "2015-05-30 22:13:09.554891"]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    if @project.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy